feaser/openblt/Target/Demo/ARMCM0_XMC1_XMC1400_Boot_Kit_Keil/Boot/lib/xmclib/inc/xmc_usic.h
/*******************************************************************************
 * DATA STRUCTURES
 *******************************************************************************/

/*Anonymous structure/union guard start*/
#if defined(__CC_ARM)
#pragma push
#pragma anon_unions
#elif defined(__TASKING__)
#pragma warning 586
#endif

/**
 * USIC module structure
 */
typedef USIC_GLOBAL_TypeDef XMC_USIC_t;

/**
 * USIC channel structure.<br> The members of the structure are same as in the device header file,
 * except for some registers.
 * DX0CR, DX1CR, DX2CR, DX3CR, DX4CR and DX5CR are replaced with the array DXCR[6].
 * TBUF0 to TBUF31 are replaced with TBUF[32].
 * IN0 to IN31 are replaced with IN[32].
 */
typedef struct XMC_USIC_CH
{
  __I  uint32_t  RESERVED0;
  __I  uint32_t  CCFG;			/**< Channel configuration register*/
  __I  uint32_t  RESERVED1;
  __IO uint32_t  KSCFG;			/**< Kernel state configuration register*/
  __IO uint32_t  FDR;			/**< Fractional divider configuration register*/
  __IO uint32_t  BRG;			/**< Baud rate generator register*/
  __IO uint32_t  INPR;			/**< Interrupt node pointer register*/
  __IO uint32_t  DXCR[6];		/**< Input control registers DX0 to DX5.*/
  __IO uint32_t  SCTR;			/**< Shift control register*/
  __IO uint32_t  TCSR;

  union
  {
    __IO uint32_t  PCR_IICMode;	/**< I2C protocol configuration register*/
    __IO uint32_t  PCR_IISMode; /**< I2S protocol configuration register*/
    __IO uint32_t  PCR_SSCMode;	/**< SPI protocol configuration register*/
    __IO uint32_t  PCR;			/**< Protocol configuration register*/
    __IO uint32_t  PCR_ASCMode;	/**< UART protocol configuration register*/
  };
  __IO uint32_t  CCR;			/**< Channel control register*/
  __IO uint32_t  CMTR;			/**< Capture mode timer register*/

  union
  {
    __IO uint32_t  PSR_IICMode;	/**< I2C protocol status register*/
    __IO uint32_t  PSR_IISMode;	/**< I2S protocol status register*/
    __IO uint32_t  PSR_SSCMode;	/**< SPI protocol status register*/
    __IO uint32_t  PSR;			/**< Protocol status register*/
    __IO uint32_t  PSR_ASCMode;	/**< UART protocol status register*/
  };
  __O  uint32_t  PSCR;			/**< Protocol status clear register*/
  __I  uint32_t  RBUFSR;		/**< Receive buffer status register*/
  __I  uint32_t  RBUF;			/**< Receive buffer register*/
  __I  uint32_t  RBUFD;			/**< Debug mode receive buffer register*/
  __I  uint32_t  RBUF0;			/**< Receive buffer 0*/
  __I  uint32_t  RBUF1;			/**< Receive buffer 1*/
  __I  uint32_t  RBUF01SR;		/**< Receive buffer status register*/
  __O  uint32_t  FMR;			/**< Flag modification register*/
  __I  uint32_t  RESERVED2[5];
  __IO uint32_t  TBUF[32];		/**< Tranmsit buffer registers*/
  __IO uint32_t  BYP;			/**< FIFO bypass register*/
  __IO uint32_t  BYPCR;			/**< FIFO bypass control register*/
  __IO uint32_t  TBCTR;			/**< Transmit FIFO control register*/
  __IO uint32_t  RBCTR;			/**< Receive FIFO control register*/
  __I  uint32_t  TRBPTR;		/**< Transmit/recive buffer pointer register*/
  __IO uint32_t  TRBSR;			/**< Transmit/receive buffer status register*/
  __O  uint32_t  TRBSCR;		/**< Transmit/receive buffer status clear register*/
  __I  uint32_t  OUTR;			/**< Receive FIFO output register*/
  __I  uint32_t  OUTDR;			/**< Receive FIFO debug output register*/
  __I  uint32_t  RESERVED3[23];
  __O  uint32_t  IN[32];		/**< Transmit FIFO input register*/
} XMC_USIC_CH_t;


/*Anonymous structure/union guard end*/
#if defined(__CC_ARM)
#pragma pop
#elif defined(__TASKING__)
#pragma warning restore
#endif

/*******************************************************************************
 * API PROTOTYPES
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif

__STATIC_INLINE bool XMC_USIC_IsModuleValid(const XMC_USIC_t *const module)
{
  bool tmp;

  tmp = (module == XMC_USIC0);
#if defined(XMC_USIC1)
  tmp = tmp || (module == XMC_USIC1);
#endif
#if defined(XMC_USIC2)
  tmp = tmp || (module == XMC_USIC2);
#endif

  return tmp;
}

__STATIC_INLINE bool XMC_USIC_IsChannelValid(const XMC_USIC_CH_t *const channel)
{
  bool tmp;

  tmp = ((channel == XMC_USIC0_CH0) || (channel == XMC_USIC0_CH1));
#if defined(XMC_USIC1)
  tmp = tmp || ((channel == XMC_USIC1_CH0) || (channel == XMC_USIC1_CH1));
#endif
#if defined(XMC_USIC2)
  tmp = tmp || ((channel == XMC_USIC2_CH0) || (channel == XMC_USIC2_CH1));
#endif

  return tmp;
}

/* Common APIs */

/**
 * @param  usic Pointer to USIC module handler of type @ref XMC_USIC_t.\n
 * 				\b Range: @ref XMC_USIC0 to @ref XMC_USIC2 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Enables the USIC module.\n\n
 * Enables the clock for the USIC module by following the
 * clock enabling sequence for the selected device.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_Enable(), XMC_USIC_Disable() \n\n\n
 */
void XMC_USIC_Enable(XMC_USIC_t *const usic);
/**
 * @param  usic Pointer to USIC module handler of type @ref XMC_USIC_t.\n
 * 				\b Range: @ref XMC_USIC0 to @ref XMC_USIC2 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Disables the USIC module.\n\n
 * Disables the clock for the USIC module by following the clock
 * disabling sequence for the selected device.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_Disable(), XMC_USIC_Enable() \n\n\n
 */
void XMC_USIC_Disable(XMC_USIC_t *const usic);
/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Enables the USIC channel. \n\n
 * USIC channel is enabled by setting the module enable bit in KSCFG register bitfield MODEN.
 * On enabling, the channel is set to idle mode.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_Disable(), XMC_USIC_Enable() \n\n\n
 */
void XMC_USIC_CH_Enable(XMC_USIC_CH_t *const channel);
/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Disables the USIC channel.\n\n
 * USIC channel is disabled by setting the module enable bit(MDEN) to 0 in the register KSCFG.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_Enable(), XMC_USIC_Disable() \n\n\n
 */
void XMC_USIC_CH_Disable(XMC_USIC_CH_t *const channel);

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  rate Desired baudrate. \b Range: minimum value = 100, maximum value depends on the peripheral clock frequency  \n
 * 				and \a oversampling. Maximum baudrate can be derived using the formula: (fperiph * 1023)/(1024 * oversampling)
 * @param  oversampling Required oversampling. The value indicates the number of time quanta for one symbol of data. \n
 * 						This can be related to the number of samples for each logic state of the data signal. \n
 * 						\b Range: 1 to 32. Value should be chosen based on the protocol used.
 * @return Status indicating the baudrate configuration.\n
 * 			\b Range: @ref XMC_USIC_CH_STATUS_OK if baudrate is successfully configured,
 * 					  @ref XMC_USIC_CH_STATUS_ERROR if desired baudrate or oversampling is invalid.
 *
 * \par<b>Description</b><br>
 * Configures the baudrate of the USIC channel. \n\n
 * Baudrate is configured by considering the peripheral frequency and the desired baudrate.
 * Optimum values of FDR->STEP and BRG->PDIV are calulated and used for generating the desired
 * baudrate.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetStartTransmisionMode(), XMC_USIC_CH_SetInputSource() \n\n\n
 */
XMC_USIC_CH_STATUS_t XMC_USIC_CH_SetBaudrate(XMC_USIC_CH_t *const channel, uint32_t rate, uint32_t oversampling);

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 *           \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  rate Desired baudrate. Only integer dividers of peripheral clock are achievable
 * @param  oversampling Required oversampling. The value indicates the number of time quanta for one symbol of data. \n
 *            This can be related to the number of samples for each logic state of the data signal. \n
 *            \b Range: 1 to 32. Value should be chosen based on the protocol used.
 * @return Status indicating the baudrate configuration.\n
 *      \b Range: @ref XMC_USIC_CH_STATUS_OK if baudrate is successfully configured,
 *            @ref XMC_USIC_CH_STATUS_ERROR if desired baudrate or oversampling is invalid.
 *
 * \par<b>Description</b><br>
 * Configures the baudrate of the USIC channel using the integer divider which restrics the achievable baudrate but decreses jitter. \n\n
 * Baudrate is configured by considering the peripheral frequency and the desired baudrate.
 * Optimum values of FDR->STEP and BRG->PDIV are calulated and used for generating the desired
 * baudrate.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetStartTransmisionMode(), XMC_USIC_CH_SetInputSource() \n\n\n
 */
XMC_USIC_CH_STATUS_t XMC_USIC_CH_SetBaudrateEx(XMC_USIC_CH_t *const channel, int32_t rate, int32_t oversampling);

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 *           \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  clksel Baudrate generator clock source.
 * @param  pppen Enable 2:1 Divider for fPPP.
 * @param  pdiv Divider Factor to generate fPDIV = fPPP / (pDIV + 1)
 * @param  ctqsel Input selection for CTQ.
 * @param  pctq Pre-Divider for Time Quanta Counter. fCTQIN / (PCQT + 1)
 * @param  dctq Denominator for Time Quanta Counter. fTQ / (DCTQ + 1)
 * @return None
 *
 * \par<b>Description</b><br>
 * Configures the baudrate generator of the USIC channel.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetFractionalDivider() \n\n\n
 */
void XMC_USIC_CH_SetBaudrateDivider(XMC_USIC_CH_t *const channel, 
                                    XMC_USIC_CH_BRG_CLOCK_SOURCE_t clksel,
                                    bool pppen,
                                    uint32_t pdiv,
                                    XMC_USIC_CH_BRG_CTQSEL_t ctqsel,
                                    uint32_t pctq,
                                    uint32_t dctq);

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 *           \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return baudrate currently used by USIC channel for .\n
 *
 * \par<b>Description</b><br>
 * Calculates the current used baudrate (fCTQIN) of a USIC channel. \n\n
 * @image html ../images/usic_brg.png
 * @image latex ../images/usic_brg.png
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetBaudrateMode(), XMC_USIC_CH_SetBaudrate(), XMC_USIC_CH_SetBaudrateEx() \n\n\n
 */
uint32_t XMC_USIC_CH_GetBaudrate(XMC_USIC_CH_t *const channel);

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 *           \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return baudrate currently used by USIC channel.\n
 *
 * \par<b>Description</b><br>
 * Calculates the current used SCLK frequency of a USIC channel. \n\n
 * @image html ../images/usic_brg.png
 * @image latex ../images/usic_brg.png
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetBaudrateMode(), XMC_USIC_CH_SetBaudrate(), XMC_USIC_CH_SetBaudrateEx() \n\n\n
 */
uint32_t XMC_USIC_CH_GetSCLKFrequency(XMC_USIC_CH_t *const channel);

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 *           \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return baudrate currently used by USIC channel.\n
 *
 * \par<b>Description</b><br>
 * Calculates the current used MCLK frequency of a USIC channel. \n\n
 * @image html ../images/usic_brg.png
 * @image latex ../images/usic_brg.png
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetBaudrateMode(), XMC_USIC_CH_SetBaudrate(), XMC_USIC_CH_SetBaudrateEx() \n\n\n
 */
uint32_t XMC_USIC_CH_GetMCLKFrequency(XMC_USIC_CH_t *const channel);

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  pdiv Desired divider for the external frequency input. \b Range: minimum value = 1, maximum value = 1024 \n
 * @param  oversampling Required oversampling. The value indicates the number of time quanta for one symbol of data. \n
 * 						This can be related to the number of samples for each logic state of the data signal. \n
 * 						\b Range: 1 to 32. Value should be chosen based on the protocol used.
 * @param  combination_mode Selects which edge of the synchronized(and optionally filtered) signal DXnS actives the trigger
 *                          output DXnT of the input stage.
 *
 * @return None
 *
 * \par<b>Description</b><br>
 * Enables the external frequency input for the Baudrate Generator and configures the divider, oversampling and
 * the combination mode of the USIC channel. \n\n
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetBRGInputClockSource(), XMC_USIC_CH_SetInputTriggerCombinationMode() \n\n\n
 */
void XMC_USIC_CH_ConfigExternalInputSignalToBRG(XMC_USIC_CH_t *const channel,
    const uint16_t pdiv,
    const uint32_t oversampling,
    const XMC_USIC_CH_INPUT_COMBINATION_MODE_t combination_mode);

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  input USIC channel input stage of type @ref XMC_USIC_CH_INPUT_t. \n
 * 				 \b Range: @ref XMC_USIC_CH_INPUT_DX0 to @ref XMC_USIC_CH_INPUT_DX5
 * @param  source Input source select for the input stage. The table below maps the enum value with the input channel.
 * <table><tr><td>0</td><td>DXnA</td></tr><tr><td>1</td><td>DXnB</td></tr><tr><td>2</td><td>DXnC</td></tr><tr><td>3</td><td>DXnD</td></tr>
 * <tr><td>4</td><td>DXnE</td></tr><tr><td>5</td><td>DXnF</td></tr><tr><td>6</td><td>DXnG</td></tr><tr><td>7</td><td>Always 1</td>
 * </tr></table>
 * @return None
 *
 * \par<b>Description</b><br>
 * Selects the data source for USIC input stage.\n\n
 * Selects the input data signal source among DXnA, DXnB.. DXnG for the input stage. The API can be used for all the input stages
 * like DX0CR, DX1CR etc.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableInputInversion(), XMC_USIC_CH_EnableInputDigitalFilter(), XMC_USIC_CH_EnableInputSync(),
 * XMC_USIC_CH_SetInputSamplingFreq()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetInputSource(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_INPUT_t input, const uint8_t source)
{
  channel->DXCR[input] = (uint32_t)((channel->DXCR[input] & (uint32_t)(~USIC_CH_DXCR_DSEL_Msk)) |
                                    ((uint32_t)source << USIC_CH_DXCR_DSEL_Pos));
}
/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  input USIC channel input stage of type @ref XMC_USIC_CH_INPUT_t. \n
 * 				 \b Range: @ref XMC_USIC_CH_INPUT_DX0 to @ref XMC_USIC_CH_INPUT_DX5
 * @return None
 *
 * \par<b>Description</b><br>
 * The input of the data shift unit is controlled by the
 * protocol pre-processor. \n\n
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_ConnectInputDataShiftToDataInput()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_ConnectInputDataShiftToPPP(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_INPUT_t input)
{
  channel->DXCR[input] &= (uint32_t)~USIC_CH_DXCR_INSW_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  input USIC channel input stage of type @ref XMC_USIC_CH_INPUT_t. \n
 * 				 \b Range: @ref XMC_USIC_CH_INPUT_DX0 to @ref XMC_USIC_CH_INPUT_DX5
 * @return None
 *
 * \par<b>Description</b><br>
 * The input of the data shift unit is connected to
 * the selected data input line. \n\n
 *
 * This setting is used
 * if the signals are directly derived from an input
 * pin without treatment by the protocol preprocessor.
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_ConnectInputDataShiftToPPP()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_ConnectInputDataShiftToDataInput(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_INPUT_t input)
{
  channel->DXCR[input] |= USIC_CH_DXCR_INSW_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  input USIC channel input stage of type @ref XMC_USIC_CH_INPUT_t. \n
 * 				 \b Range: @ref XMC_USIC_CH_INPUT_DX0 to @ref XMC_USIC_CH_INPUT_DX5
 * @return None
 *
 * \par<b>Description</b><br>
 * Enables input inversion for USIC channel input data signal. \n\n
 *
 * Polarity of the input source can be changed to provide inverted data input.
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_DisableInputInversion()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_EnableInputInversion(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_INPUT_t input)
{
  channel->DXCR[input] |= USIC_CH_DXCR_DPOL_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  input USIC channel input stage of type @ref XMC_USIC_CH_INPUT_t. \n
 * 				 \b Range: @ref XMC_USIC_CH_INPUT_DX0 to @ref XMC_USIC_CH_INPUT_DX5
 * @return None
 *
 * \par<b>Description</b><br>
 * Disables input inversion for USIC channel. \n\n
 *
 * Resets the input data polarity for the USIC channel input data signal.
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableInputInversion()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_DisableInputInversion(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_INPUT_t input)
{
  channel->DXCR[input] &= (uint32_t)~USIC_CH_DXCR_DPOL_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Enables delay compensation. \n\n
 *
 * Delay compensation can be applied to the receive path.
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_DisableDelayCompensation()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_EnableDelayCompensation(XMC_USIC_CH_t *const channel)
{
  channel->DXCR[1U] |= USIC_CH_DX1CR_DCEN_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Disables delay compensation.. \n\n
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableDelayCompensation()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_DisableDelayCompensation(XMC_USIC_CH_t *const channel)
{
  channel->DXCR[1U] &= (uint32_t)~USIC_CH_DX1CR_DCEN_Msk;
}

