feaser/openblt/Target/Demo/ARMCM0_XMC1_XMC1400_Boot_Kit_Keil/Boot/lib/xmclib/inc/xmc_usic.h
/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  input USIC channel input stage of type @ref XMC_USIC_CH_INPUT_t. \n
 * 				 \b Range: @ref XMC_USIC_CH_INPUT_DX0 to @ref XMC_USIC_CH_INPUT_DX5
 * @return None
 *
 * \par<b>Description</b><br>
 * Enables the input digital filter for USIC channel input data signal. \n\n
 * Input data signal from the selected multiplexer will be digitally filtered.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_DisableInputDigitalFilter()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_EnableInputDigitalFilter(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_INPUT_t input)
{
  channel->DXCR[input] |= (uint32_t)USIC_CH_DXCR_DFEN_Msk;
}
/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  input USIC channel input stage of type @ref XMC_USIC_CH_INPUT_t. \n
 * 				 \b Range: @ref XMC_USIC_CH_INPUT_DX0 to @ref XMC_USIC_CH_INPUT_DX5
 * @return None
 *
 * \par<b>Description</b><br>
 * Disables the input digital filter for USIC channel input data signal. \n\n
 * Input data signal from the selected multiplexer will not be digitally filtered.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableInputDigitalFilter()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_DisableInputDigitalFilter(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_INPUT_t input)
{
  channel->DXCR[input] &= (uint32_t)~USIC_CH_DXCR_DFEN_Msk;
}
/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  input USIC channel input stage of type @ref XMC_USIC_CH_INPUT_t. \n
 * 				 \b Range: @ref XMC_USIC_CH_INPUT_DX0 to @ref XMC_USIC_CH_INPUT_DX5
 * @return None
 *
 * \par<b>Description</b><br>
 * Enables input synchronization for the USIC channel input data signal. \n\n
 * Input data signal from the selected multiplexer will be synchronized with fPERIPH.
 * A noisy signal can be synchronized and filtered by enabling the digital filter.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_DisableInputSync(), XMC_USIC_CH_EnableInputDigitalFilter()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_EnableInputSync(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_INPUT_t input)
{
  channel->DXCR[input] |= (uint32_t)USIC_CH_DXCR_DSEN_Msk;
}
/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  input USIC channel input stage of type @ref XMC_USIC_CH_INPUT_t. \n
 * 				 \b Range: @ref XMC_USIC_CH_INPUT_DX0 to @ref XMC_USIC_CH_INPUT_DX5
 * @return None
 *
 * \par<b>Description</b><br>
 * Disables input synchronization for the USIC channel input data signal. \n\n
 * Input data signal from the selected multiplexer will not be synchronized.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableInputSync(), XMC_USIC_CH_DisableInputDigitalFilter() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_DisableInputSync(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_INPUT_t input)
{
  channel->DXCR[input] &= (uint32_t)~USIC_CH_DXCR_DSEN_Msk;
}
/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support..
 * @param  input USIC channel input stage of type @ref XMC_USIC_CH_INPUT_t. \n
 * 				 \b Range: @ref XMC_USIC_CH_INPUT_DX0 to @ref XMC_USIC_CH_INPUT_DX5
 * @param  sampling_freq Sampling frequency value of type \a XMC_USIC_CH_INPUT_SAMPLING_FREQ_t.
 * @return None
 *
 * \par<b>Description</b><br>
 * Sets sampling frequency for USIC channel input data signal. \n\n
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetInputSource(), XMC_USIC_CH_EnableInputSync(), XMC_USIC_CH_EnableInputDigitalFilter() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetInputSamplingFreq(XMC_USIC_CH_t *const channel,
    const XMC_USIC_CH_INPUT_t input,
    const XMC_USIC_CH_INPUT_SAMPLING_FREQ_t sampling_freq)
{
  channel->DXCR[input] = (uint32_t)(channel->DXCR[input] & (~USIC_CH_DXCR_SFSEL_Msk)) |
                         ((uint32_t)sampling_freq);
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support..
 * @param  input USIC channel input stage of type @ref XMC_USIC_CH_INPUT_t. \n
 * 				 \b Range: @ref XMC_USIC_CH_INPUT_DX0 to @ref XMC_USIC_CH_INPUT_DX5
 * @param  combination_mode Combination mode value of type \a XMC_USIC_CH_INPUT_COMBINATION_MODE_t.
 * @return None
 *
 * \par<b>Description</b><br>
 * Selects which edge of the synchronized signal DXnS activates the trigger output DXnT of the input stage. \n\n
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetInputSource(), XMC_USIC_CH_EnableInputSync(), XMC_USIC_CH_EnableInputDigitalFilter() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetInputTriggerCombinationMode(XMC_USIC_CH_t *const channel,
    const XMC_USIC_CH_INPUT_t input,
    const XMC_USIC_CH_INPUT_COMBINATION_MODE_t combination_mode)
{
  channel->DXCR[input] = (uint32_t)(channel->DXCR[input] & (~USIC_CH_DXCR_CM_Msk)) |
                         ((uint32_t)combination_mode << USIC_CH_DXCR_CM_Pos);
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  clock_source clock source for the BRG.
 * @return None
 *
 * \par<b>Description</b><br>
 * Sets the clock source for the BRG. \n\n
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetInputTriggerCombinationMode(), XMC_USIC_CH_SetExternalClockBRGDivider()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetBRGInputClockSource(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_BRG_CLOCK_SOURCE_t clock_source)
{
  channel->BRG = (uint32_t)(channel->BRG & (~USIC_CH_BRG_CLKSEL_Msk)) | (uint32_t)(clock_source);
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param data Data to be transmitted. \n
 *           \b Range: 16bit unsigned data. minimum= 0, maximum= 65535
 * @return None
 *
 * \par<b>Description</b><br>
 * Writes data into the transmit buffer. \n\n
 * The data provided is placed in TBUF[0U].
 *
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_WriteToTBUFTCI() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_WriteToTBUF(XMC_USIC_CH_t *const channel, const uint16_t data)
{
  channel->TBUF[0U] = data;
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param data Data to be transmitted.
 * @param transmit_control_information transmit control information to be configured while transmitting the data. \n
 * 			\b Range: minimum= 0, maximum= 31.
 * @return None
 *
 * \par<b>Description</b><br>
 * Writes data to the transmit buffer in a control mode. \n\n
 * When the respective control mode is enabled , this API can be used.
 *
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_WriteToTBUF() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_WriteToTBUFTCI(XMC_USIC_CH_t *const channel,
    const uint16_t data,
    const uint32_t transmit_control_information)
{
  channel->TBUF[transmit_control_information] = data;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  word_length Number of bits to be configured for a data word. \n
 * 					   \b Range: minimum= 1, maximum= 16. \n
 * 					   e.g: For word length of 8, \a word_length should be provided as 8.
 * @return None
 *
 * \par<b>Description</b><br>
 * Sets the data word length in number of bits. \n\n
 * Sets the number of bits to represent a data word. Frame length should be a multiple of word length.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetFrameLength()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetWordLength(XMC_USIC_CH_t *const channel, const uint8_t word_length)
{
  channel->SCTR = (uint32_t)(channel->SCTR & (~USIC_CH_SCTR_WLE_Msk)) |
                  (uint32_t)(((uint32_t)word_length - 1UL)  << USIC_CH_SCTR_WLE_Pos);
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 *           \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  word_length Number of bits to be configured for a data word. \n
 *             \b Range: minimum= 1, maximum= 16. \n
 *             e.g: For word length of 8, \a word_length should be provided as 8.
 * @return None
 *
 * \par<b>Description</b><br>
 * Sets the data word length in number of bits. \n\n
 * Sets the number of bits to represent a data word. Frame length should be a multiple of word length.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetFrameLength()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetShiftDirection(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_SHIFT_DIRECTION_t shift_direction)
{
  channel->SCTR = (uint32_t)(channel->SCTR & (~USIC_CH_SCTR_SDIR_Msk)) | (uint32_t)shift_direction;
}


/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 *           \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return Captured counter value
 *
 *
 * \par<b>Description</b><br>
 * The value of the counter is captured if one of the trigger signals DX0T or DX1T are activated by the corresponding input stage.
 */
__STATIC_INLINE uint32_t XMC_USIC_CH_GetCaptureTimerValue(const XMC_USIC_CH_t *const channel)
{
  return channel->CMTR;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 *           \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  mode divider mode ::XMC_USIC_CH_BRG_CLOCK_DIVIDER_MODE_t \n
 * @param  step divider \n
 *             \b XMC_USIC_CH_BRG_CLOCK_DIVIDER_MODE_NORMAL resulting divider = 1023 - step \n
 *             \b XMC_USIC_CH_BRG_CLOCK_DIVIDER_MODE_FRACTIONAL resulting divider = 1023 / step \n
 *
 * @return None
 *
 * \par<b>Description</b><br>
 * The fractional divider generates its output frequency fFD by either dividing the input frequency fPERIPH by an integer factor n or by multiplication of n/1024.
 *
 */
__STATIC_INLINE void XMC_USIC_CH_SetFractionalDivider(XMC_USIC_CH_t *const channel, const XMC_USIC_CH_BRG_CLOCK_DIVIDER_MODE_t mode, const uint16_t step)
{
  channel->FDR = mode | step;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  frame_length Number of bits in a frame. \n
 * 						\b Range: minimum= 1, maximum= 0x3f. The maximum value for fixed frame size is 0x3f. \n
 * 						e.g: For a frame length of 16, \a frame_length should be provided as 16.
 * @return None
 *
 * \par<b>Description</b><br>
 * Define the data frame length.\n\n
 * Set the number of bits to be serially transmitted in a frame.
 * The frame length should be multiples of word length. If the value is set to 0x40, the frame length
 * has to be controlled explicitly.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetWordLength(), XMC_USIC_CH_EnableFrameLengthControl() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetFrameLength(XMC_USIC_CH_t *const channel, const uint8_t frame_length)
{
  channel->SCTR = (uint32_t)(channel->SCTR & (~USIC_CH_SCTR_FLE_Msk)) |
                  (((uint32_t)frame_length - 0x1U)  << USIC_CH_SCTR_FLE_Pos);
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param event Bit mask of the channel events to be enabled. Use @ref XMC_USIC_CH_EVENT_t for the bit masks. \n
 * 				\b Range: @ref XMC_USIC_CH_EVENT_RECEIVE_START, @ref XMC_USIC_CH_EVENT_DATA_LOST etc. Multiple events
 * 				can be combined using \a OR operation.
 * @return None
 *
 * \par<b>Description</b><br>
 * Enable the channel interrupt events.\n\n
 * Common channel events related to serial communication can be configured using this API.
 * Multiple events can be combined using the bitwise OR operation and configured in one function call.
 * XMC_USIC_CH_EVENT_t enumerates multiple protocol event bitmasks. These enumerations can be used as input to the API.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_DisableEvent(), XMC_USIC_CH_SetInterruptNodePointer() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_EnableEvent(XMC_USIC_CH_t *const channel, const uint32_t event)
{
  channel->CCR |= event;
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				  \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param event Bit mask of the channel events to be disabled. Use @ref XMC_USIC_CH_EVENT_t for the bit masks. \n
 * 				\b Range: @ref XMC_USIC_CH_EVENT_RECEIVE_START, @ref XMC_USIC_CH_EVENT_DATA_LOST etc. Multiple events
 * 				can be combined using \a OR operation.
 * @return None
 *
 * \par<b>Description</b><br>
 * Disable the channel interrupt events. \n\n
 * Multiple events can be combined using the bitwise OR operation and configured in one function call.
 * XMC_USIC_CH_EVENT_t enumerates multiple protocol event bitmasks. These enumerations can be used as input to the API.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableEvent(), XMC_USIC_CH_SetInterruptNodePointer() \n\n\n
*/
__STATIC_INLINE void XMC_USIC_CH_DisableEvent(XMC_USIC_CH_t *const channel, const uint32_t event)
{
  channel->CCR &= (uint32_t)~event;
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				  \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  interrupt_node Interrupt node pointer to be configured. \n
 * 						  \b Range: @ref XMC_USIC_CH_INTERRUPT_NODE_POINTER_TRANSMIT_SHIFT,
 * 						  			@ref XMC_USIC_CH_INTERRUPT_NODE_POINTER_TRANSMIT_BUFFER etc.
 * @param service_request Service request number.\n
 * 						  \b Range: 0 to 5.
 * @return None
 *
 * \par<b>Description</b><br>
 * Sets the interrupt node for USIC channel events. \n\n
 * For an event to generate interrupt, node pointer should be configured with service request(SR0, SR1..SR5).
 * The NVIC node gets linked to the interrupt event by doing so.<br>
 * Note: NVIC node should be separately enabled to generate the interrupt.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableEvent() \n\n\n
 */
void XMC_USIC_CH_SetInterruptNodePointer(XMC_USIC_CH_t *const channel,
    const XMC_USIC_CH_INTERRUPT_NODE_POINTER_t interrupt_node,
    const uint32_t service_request);

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return Stataus @ref XMC_USIC_CH_TBUF_STATUS_IDLE if transmit buffer is free,
 *                 @ref XMC_USIC_CH_TBUF_STATUS_BUSY if transmit buffer is busy.
 *
 * \par<b>Description</b><br>
 * Gets transmit buffer status. \n\n
 * Status indicates whether the transmit buffer is free, or busy transmitting data.
 * The status depends on the value of TDV flag in TCSR register.
 * This status can be used while transmitting data. Transmit data when the transmit buffer
 * status is @ref XMC_USIC_CH_TBUF_STATUS_IDLE.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetDataOutputMode() \n\n\n
 */
__STATIC_INLINE XMC_USIC_CH_TBUF_STATUS_t XMC_USIC_CH_GetTransmitBufferStatus(XMC_USIC_CH_t *const channel)
{
  return (XMC_USIC_CH_TBUF_STATUS_t)(channel->TCSR & USIC_CH_TCSR_TDV_Msk);
}

/**
 * @brief API to get receive buffer status
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return Status of data validity check for RBUF0 and RBUF1. \n
 * 		   Returned value should be masked with RDV0 and RDV1 bits to know the status. \n
 * 		   \b Range: @ref XMC_USIC_CH_RBUF_STATUS_DATA_VALID0, @ref XMC_USIC_CH_RBUF_STATUS_DATA_VALID1.
 *
 * \par<b>Description</b><br>
 * Checks if RBUF0 and RBUF1 have valid unread data. \n\n
 * It checks the bits RDV0 and RDV1 of the RBUFSR register.
 * Returns the value of RBUFSR masked with bitmasks of RDV0 and RDV1.
 * It can be used to decide whether 2bytes has to be read from RBUF or 1 byte.
 * If both bitmasks XMC_USIC_CH_RBUF_STATUS_DATA_VALID0 and XMC_USIC_CH_RBUF_STATUS_DATA_VALID1
 * are set, then 2 bytes can be read from RBUF. If only either of them is set, then only one byte
 * can be read from RBUF.
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_GetTransmitBufferStatus() \n\n\n
 */
__STATIC_INLINE uint32_t XMC_USIC_CH_GetReceiveBufferStatus(XMC_USIC_CH_t *const channel)
{
  return ((uint32_t) (channel->RBUFSR & (USIC_CH_RBUFSR_RDV0_Msk | USIC_CH_RBUFSR_RDV1_Msk)));
}


/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  start_transmision_mode Transmission mode to be enabled. \n
 * 								\b Range: @ref XMC_USIC_CH_START_TRANSMISION_DISABLED,
 * 								@ref XMC_USIC_CH_START_TRANSMISION_ON_TDV, @ref XMC_USIC_CH_START_TRANSMISION_ON_TDV_DX2S_0,
 * 								@ref XMC_USIC_CH_START_TRANSMISION_ON_TDV_DX2S_1
 *
 * @return None
 *
 * \par<b>Description</b><br>
 * Configures data transmission. \n\n
 * The configuration affects the data shifted on the DOUT0 pin.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_GetTransmitBufferStatus(), XMC_USIC_CH_SetDataOutputMode() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetStartTransmisionMode(XMC_USIC_CH_t *const channel,
    const XMC_USIC_CH_START_TRANSMISION_MODE_t start_transmision_mode)
{
  channel->TCSR = (uint32_t)(channel->TCSR & (~USIC_CH_TCSR_TDEN_Msk)) | (uint32_t)start_transmision_mode;
}


/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  data_output_mode  Data output mode. \n
 * 			\b Range: @ref XMC_USIC_CH_DATA_OUTPUT_MODE_NORMAL, @ref XMC_USIC_CH_DATA_OUTPUT_MODE_INVERTED
 * @return None
 *
 * \par<b>Description</b><br>
 * Configures the mode for data output. \n\n
 * USIC channel can be configured to shift inverted data or direct data based on the input to the API.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetStartTransmisionMode() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetDataOutputMode(XMC_USIC_CH_t *const channel,
    const XMC_USIC_CH_DATA_OUTPUT_MODE_t data_output_mode)
{
  channel->SCTR = (uint32_t)(channel->SCTR & (~USIC_CH_SCTR_DOCFG_Msk)) | (uint32_t)data_output_mode;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Enables automatic update of frame length. \n\n
 * When the automatic update of frame length is enabled, frame length is configured based on the
 * index of the TBUF[]/IN[] register array. When the data is written to TBUF[x], frame length is configured
 * with the mask value of \a x at the last 5 bit positions. Same logic is applicable if data is written to
 * IN[x] register.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_DisableFrameLengthControl(), XMC_USIC_CH_TXFIFO_PutDataFLEMode() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_EnableFrameLengthControl(XMC_USIC_CH_t *const channel)
{
  channel->TCSR = (uint32_t)(channel->TCSR & (~(USIC_CH_TCSR_WLEMD_Msk |
                             USIC_CH_TCSR_SELMD_Msk |
                             USIC_CH_TCSR_WAMD_Msk |
                             USIC_CH_TCSR_HPCMD_Msk))) |
                  (uint32_t)USIC_CH_TCSR_FLEMD_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Enables automatic update of word length. \n\n
 * When the automatic update of word length is enabled, word length is configured based on the
 * index of the TBUF[]/IN[] register array. When the data is written to TBUF[x], word length is configured
 * with the mask value of \a x at the last 5 bit positions. Same logic is applicable if data is written to
 * IN[x] register.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_DisableFrameLengthControl(), XMC_USIC_CH_TXFIFO_PutDataFLEMode() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_EnableWordLengthControl(XMC_USIC_CH_t *const channel)
{
  channel->TCSR = (uint32_t)(channel->TCSR & (~(USIC_CH_TCSR_WLEMD_Msk |
                             USIC_CH_TCSR_SELMD_Msk |
                             USIC_CH_TCSR_WAMD_Msk |
                             USIC_CH_TCSR_HPCMD_Msk))) |
                  (uint32_t)USIC_CH_TCSR_WLEMD_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Disables automatic update of frame length. \n\n
 * When automatic update of frame length is disabled, frame length has to configured explicitly.
 * Frame length remains fixed until it is changed again.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableFrameLengthControl(), XMC_USIC_CH_SetFrameLength() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_DisableFrameLengthControl(XMC_USIC_CH_t *const channel)
{
  channel->TCSR &= (uint32_t)~USIC_CH_TCSR_FLEMD_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Disables automatic update of word length. \n\n
 * When automatic update of word length is disabled, word length has to configured explicitly.
 * Word length remains fixed until it is changed again.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableFrameLengthControl(), XMC_USIC_CH_SetWordLength() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_DisableWordLengthControl(XMC_USIC_CH_t *const channel)
{
  channel->TCSR &= (uint32_t)~USIC_CH_TCSR_WLEMD_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Bit TCSR.TE is set if DX2T becomes active while TDV = 1. \n\n
 * Enables the transfer trigger unit to set bit TCSR.TE if the trigger signal DX2T becomes active
 * for event driven transfer starts.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_DisableTBUFDataValidTrigger()\n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_EnableTBUFDataValidTrigger(XMC_USIC_CH_t *const channel)
{
  channel->TCSR |= (uint32_t)USIC_CH_TCSR_TDVTR_Msk;
}

