feaser/openblt/Target/Demo/ARMCM0_XMC1_XMC1400_Boot_Kit_Keil/Boot/lib/xmclib/inc/xmc_usic.h
/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Disables the trigger of TDV depending on DX2T signal. \n\n
 * Bit TCSR.TE is permanently set.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableTBUFDataValidTrigger() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_DisableTBUFDataValidTrigger(XMC_USIC_CH_t *const channel)
{
  channel->TCSR &= (uint32_t)~USIC_CH_TCSR_TDVTR_Msk;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  service_request_line service request number of the event to be triggered. \n
 * 			\b Range: 0 to 5.
 * @return None
 *
 * \par<b>Description</b><br>
 * Trigger a USIC interrupt service request.\n\n
 * When the USIC service request is triggered, the NVIC interrupt associated with it will be
 * generated if enabled.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_SetInterruptNodePointer() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_TriggerServiceRequest(XMC_USIC_CH_t *const channel, const uint32_t service_request_line)
{
  channel->FMR = (uint32_t)(USIC_CH_FMR_SIO0_Msk << service_request_line);
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  transmit_buffer_status clearing or setting the TDV flag. \n
 *
 * @return None
 *
 * \par<b>Description</b><br>
 * Modify TCSR.TDV and TCSR.TE to control the start of a data word transmission by software.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_GetTransmitBufferStatus() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetTransmitBufferStatus(XMC_USIC_CH_t *const channel,
    const XMC_USIC_CH_TBUF_STATUS_SET_t transmit_buffer_status)
{
  channel->FMR = (uint32_t)transmit_buffer_status;
}

/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 *
 * @return None
 *
 * \par<b>Description</b><br>
 * Modify TCSR.TDV and TCSR.TE to control the start of a data word transmission by software.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_GetTransmitBufferStatus() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_InvalidateReadData(XMC_USIC_CH_t *const channel)
{
  channel->FMR = USIC_CH_FMR_CRDV0_Msk | USIC_CH_FMR_CRDV1_Msk;
}


/**
 * @param  channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  passive_level Value of passive level for the channel. \n
 * 			\b Range: @ref XMC_USIC_CH_PASSIVE_DATA_LEVEL0, @ref XMC_USIC_CH_PASSIVE_DATA_LEVEL1
 * @return None
 *
 * \par<b>Description</b><br>
 * Set the passive data level of the output signal. \n\n
 * When the USIC channel transmit stage is idle, the output signal level stays at the
 * configured passive level.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_GetTransmitBufferStatus(), XMC_USIC_CH_SetStartTransmisionMode() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_SetPassiveDataLevel(XMC_USIC_CH_t *const channel,
    const XMC_USIC_CH_PASSIVE_DATA_LEVEL_t passive_level)
{
  channel->SCTR &= (~USIC_CH_SCTR_PDL_Msk);
  channel->SCTR |= (uint32_t)passive_level;
}

/* TX FIFO APIs */
/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param data_pointer Start position inside the FIFO buffer. \n
 * 		\b Range: 0 to 63.
 * @param size Required size of the transmit FIFO. \n
 * 		\b Range: @ref XMC_USIC_CH_FIFO_DISABLED, @ref XMC_USIC_CH_FIFO_SIZE_2WORDS.. @ref XMC_USIC_CH_FIFO_SIZE_64WORDS
 * @param limit Threshold of transmit FIFO filling level to be considered for generating events. \n
 * 		\b Range: 0 to \a size -1.
 * @return None
 *
 * \par<b>Description</b><br>
 * Initializes the transmit FIFO. \n\n
 * Transmit FIFO is a subset of a common FIFO sized 64 words. This FIFO is shared between 2 channels of the USIC module.
 * Each channel can share the FIFO for transmission and reception. \a data_pointer represents the start index in the common FIFO,
 * from where transmit data can be put, for the selected USIC channel. \a size represents the size of transmit FIFO as a multiple of
 * 2. Since the FIFO is shared between 2 USIC channels, FIFO size should be carefully selected. A FIFO standard transmit buffer
 * event is generated when the FIFO filling level falls below the \a limit value.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_EnableEvent(), XMC_USIC_CH_TXFIFO_SetInterruptNodePointer() \n\n\n
 */
void XMC_USIC_CH_TXFIFO_Configure(XMC_USIC_CH_t *const channel,
                                  const uint32_t data_pointer,
                                  const XMC_USIC_CH_FIFO_SIZE_t size,
                                  const uint32_t limit);

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param size Required size of the transmit FIFO. \n
 * 		\b Range: @ref XMC_USIC_CH_FIFO_DISABLED, @ref XMC_USIC_CH_FIFO_SIZE_2WORDS.. @ref XMC_USIC_CH_FIFO_SIZE_64WORDS
 * @param limit Threshold for transmit FIFO filling level to be considered for generating events. \n
 * 		\b Range: 0 to \a size -1.
 * @return None
 *
 * \deprecated { Use XMC_USIC_CH_TXFIFO_SetSizeTriggerLimit() }
 *
 * \par<b>Description</b><br>
 * Sets the size and trigger limit for the transmit FIFO. \n\n
 * The API is not to be called for initializing the transmit FIFO. The API shall be used for the
 * runtime change of transmit FIFO trigger limit. FIFO start position will not be affected on execution.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_RXFIFO_SetSizeTriggerLimit() \n\n\n
 */
void XMC_USIC_CH_TXFIFO_SetSizeTriggerLimit(XMC_USIC_CH_t *const channel,
    const XMC_USIC_CH_FIFO_SIZE_t size,
    const uint32_t limit);


/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param limit Threshold for transmit FIFO filling level to be considered for generating events. \n
 * 		\b Range: 0 to \a fifo size -1.
 * @return None
 *
 * \par<b>Description</b><br>
 * Sets the trigger limit for the TX FIFO. \n\n
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_RXFIFO_SetSizeTriggerLimit() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_TXFIFO_SetTriggerLimit(XMC_USIC_CH_t *const channel,
    const uint32_t limit)
{
  channel->TBCTR = (channel->TBCTR & (uint32_t)~USIC_CH_TBCTR_LIMIT_Msk) | ((limit << USIC_CH_TBCTR_LIMIT_Pos) & USIC_CH_TBCTR_LIMIT_Msk);
}



/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param event Events to be enabled. Multiple events can be bitwise OR combined. @ref XMC_USIC_CH_TXFIFO_EVENT_CONF_t \n
 * @return None
 *
 * \par<b>Description</b><br>
 * Enables the interrupt events related to transmit FIFO. \n\n
 * Event bitmasks can be constructed using the enumeration @ref XMC_USIC_CH_TXFIFO_EVENT_CONF_t.
 * Multiple events can be enabled by providing multiple events in a single call. For providing
 * multiple events, combine the events using bitwise OR operation. Events are configured in the TBCTR register.<br>
 *
 * Note: API only enables the events. For interrupt generation, interrupt node must be configured and NVIC node
 * must be enabled.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_SetInterruptNodePointer() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_TXFIFO_EnableEvent(XMC_USIC_CH_t *const channel, const uint32_t event)
{
  channel->TBCTR |= event;
}


/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param event Events to be disabled. @ref XMC_USIC_CH_TXFIFO_EVENT_CONF_t \n
 * @return None
 *
 * \par<b>Description</b><br>
 * Disables the interrupt events related to transmit FIFO. \n\n
 * By disabling the interrupt events, generation of interrupt is stopped. User can poll the event
 * flags from the status register using the API XMC_USIC_CH_TXFIFO_GetEvent().
 * Event bitmasks can be constructed using the enumeration @ref XMC_USIC_CH_TXFIFO_EVENT_CONF_t. For providing
 * multiple events, combine the events using bitwise OR operation.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_GetEvent(), XMC_USIC_CH_TXFIFO_EnableEvent() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_TXFIFO_DisableEvent(XMC_USIC_CH_t *const channel, const uint32_t event)
{
  channel->TBCTR &= (uint32_t)~event;
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				      \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param interrupt_node Node pointer representing the transmit FIFO events. \n
 * 						  \b Range: @ref XMC_USIC_CH_TXFIFO_INTERRUPT_NODE_POINTER_STANDARD,
 * 						  			@ref XMC_USIC_CH_TXFIFO_INTERRUPT_NODE_POINTER_ALTERNATE
 * @param service_request The service request to be used for interrupt generation. \n
 * 						  \b Range: 0 to 5.
 * @return None
 *
 * \par<b>Description</b><br>
 * Sets an interrupt node for the transmit FIFO events.\n\n
 * A node pointer represents one or more interrupt events. Service request represents the interrupt node to be used
 * among the 6 interrupt nodes available for USIC module.
 * API configures the service request to be used for interrupt generation for the events selected.
 * A transmit FIFO event can generate an interrupt only if the interrupt node is configured for the event and
 * the interrupt generation is enabled for the event. For example, transmit FIFO standard transmit buffer
 * interrupt is generated if the interrupt node for the same is set and interrupt is enabled.<br>
 *
 * Note: NVIC node should be explicitly enabled for the interrupt generation.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_EnableEvent() \n\n\n
 */
void XMC_USIC_CH_TXFIFO_SetInterruptNodePointer(XMC_USIC_CH_t *const channel,
    const XMC_USIC_CH_TXFIFO_INTERRUPT_NODE_POINTER_t interrupt_node,
    const uint32_t service_request);

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param data Data to be transmitted. \n
 *           \b Range: 16bit unsigned data. minimum= 0, maximum= 65535
 * @return None
 *
 * \par<b>Description</b><br>
 * Writes data into the transmit FIFO. \n\n
 * The data provided is placed in the transmit FIFO.
 * The transmit FIFO should be configured before calling this API.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_EnableEvent() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_TXFIFO_PutData(XMC_USIC_CH_t *const channel, const uint16_t data)
{
  channel->IN[0] = data;
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param data Data to be transmitted. \n
 *           \b Range: 16bit unsigned data. minimum= 0, maximum= 65535
 * @param loc Input location. \n
 * @return None
 *
 * \par<b>Description</b><br>
 * Transmit data can be loaded to TBUF by software by writing to the transmit buffer input
 * locations TBUFx (x = 00-31), consisting of 32 consecutive addresses. The data written
 * to one of these input locations is stored in the transmit buffer TBUF. Additionally, the
 * address of the written location is evaluated and can be used for additional control
 * purposes. This 5-bit wide information (named Transmit Control Information TCI) can be
 * used for different purposes in different protocols.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableWordLengthControl() \n
 * XMC_USIC_CH_EnableFrameLengthControl() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_TXFIFO_PutDataEx(XMC_USIC_CH_t *const channel, const uint16_t data, uint8_t loc)
{
  channel->IN[loc] = data;
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param data Data to be transmitted.
 * @param frame_length Frame length to be configured while transmitting the data. \n
 * 			\b Range: minimum= 0, maximum= 31. e.g: For a frame length of 16, set \a frame_length as 15.
 * @return None
 *
 * \par<b>Description</b><br>
 * Writes data to the transmit FIFO in frame length control mode. \n\n
 * When frame length control is enabled for dynamic update of frame length, this API can be used.
 * \a frame_length represents the frame length to be updated by the peripheral.
 * \a frame_length is used as index for the IN[] register array.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_PutDataEx() \n
 * XMC_USIC_CH_EnableFrameLengthControl() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_TXFIFO_PutDataFLEMode(XMC_USIC_CH_t *const channel,
    const uint16_t data,
    const uint32_t frame_length)
{
  channel->IN[frame_length] = data;
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param data Data to be transmitted.
 * @param frame_length Frame length to be configured while transmitting the data. \n
 * 			\b Range: minimum= 0, maximum= 31. e.g: For a frame length of 16, set \a frame_length as 15.
 * @return None
 *
 * \par<b>Description</b><br>
 * Writes data to the transmit FIFO in hardware port control mode. \n\n
 * When hardware port control is enabled for dynamic update of frame length, this API can be used.
 * \a frame_length represents the frame length to be updated by the peripheral.
 * \a frame_length is used as index for the IN[] register array.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_EnableFrameLengthControl() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_TXFIFO_PutDataHPCMode(XMC_USIC_CH_t *const channel,
    const uint16_t data,
    const uint32_t frame_length)
{
  channel->IN[frame_length] = data;
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return None
 *
 * \par<b>Description</b><br>
 * Clears the contents of transmit FIFO. \n\n
 * Transmit FIFO contents will be cleared and the filling level will be reset to 0.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_GetLevel() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_TXFIFO_Flush(XMC_USIC_CH_t *const channel)
{
  channel->TRBSCR = (uint32_t)USIC_CH_TRBSCR_FLUSHTB_Msk;
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return Status \a true if transmit FIFO is full
 *              \a false if transmit FIFO is not full.
 *
 * \par<b>Description</b><br>
 * Checks if transmit FIFO is full. \n\n
 * When the transmit FIFO filling level reaches the configured size, FIFO full flag is set.
 * User should not write to the FIFO when the transmit FIFO is full.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_IsEmpty(), XMC_USIC_CH_TXFIFO_Flush() \n\n\n
 */
__STATIC_INLINE bool XMC_USIC_CH_TXFIFO_IsFull(XMC_USIC_CH_t *const channel)
{
  return (bool)(channel->TRBSR & USIC_CH_TRBSR_TFULL_Msk);
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return Status \a true if transmit FIFO is empty
 *              \a false if transmit FIFO has some data.
 *
 * \par<b>Description</b><br>
 * Checks if transmit FIFO is empty. \n\n
 * When the transmit FIFO is empty, data can be written to FIFO.
 * When the last written word to the transmit FIFO is transmitted out of the FIFO,
 * FIFO empty flag is set.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_Flush(), XMC_USIC_CH_TXFIFO_PutData() \n\n\n
 */
__STATIC_INLINE bool XMC_USIC_CH_TXFIFO_IsEmpty(XMC_USIC_CH_t *const channel)
{
  return (bool)(channel->TRBSR & USIC_CH_TRBSR_TEMPTY_Msk);
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return Transmit FIFO filling level. \n
 *           \b Range: minimum= 0(FIFO empty), maximum= transmit FIFO size.
 *
 * \par<b>Description</b><br>
 * Gets the transmit FIFO filling level. \n\n
 * For every word written to the FIFO, filling level is updated. The API gives the value
 * of this filling level.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_Flush(), XMC_USIC_CH_TXFIFO_PutData() \n\n\n
 */
__STATIC_INLINE uint32_t XMC_USIC_CH_TXFIFO_GetLevel(XMC_USIC_CH_t *const channel)
{
  return ((uint32_t)(channel->TRBSR & USIC_CH_TRBSR_TBFLVL_Msk) >> USIC_CH_TRBSR_TBFLVL_Pos);
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @return Status of standard transmit and transmit buffer error events. @ref XMC_USIC_CH_TXFIFO_EVENT_t \n
 *
 * \par<b>Description</b><br>
 * Gets the transmit FIFO event status. \n\n
 * Gives the status of transmit FIFO standard transmit buffer event and transmit buffer error event.
 * The status bits are located at their bit positions in the TRBSR register in the returned value.
 * User can make use of the @ref XMC_USIC_CH_TXFIFO_EVENT_t enumeration for checking the status of return value.
 * The status can be found by using the bitwise AND operation on the returned value with the enumerated value.<br>
 *
 * Note: Event status flags should be cleared by the user explicitly.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_ClearEvent() \n\n\n
 */
__STATIC_INLINE uint32_t XMC_USIC_CH_TXFIFO_GetEvent(XMC_USIC_CH_t *const channel)
{
  return (uint32_t)((channel->TRBSR) & (USIC_CH_TRBSR_STBI_Msk |
                                        USIC_CH_TRBSR_TBERI_Msk));
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param  event Transmit FIFO events to be cleared. \n
 * 			     \b Range: @ref XMC_USIC_CH_TXFIFO_EVENT_STANDARD, @ref XMC_USIC_CH_TXFIFO_EVENT_ERROR.
 * @return None
 *
 * \par<b>Description</b><br>
 * Clears the transmit FIFO event flags in the status register. \n\n
 * USIC channel peripheral does not clear the event flags after they are read.
 * This API clears the events provided in the \a mask value.
 * XMC_USIC_CH_TXFIFO_EVENT enumeration can be used as input. Multiple events
 * can be cleared by providing a mask value obtained by bitwise OR operation of
 * multiple event enumerations.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_GetEvent() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_TXFIFO_ClearEvent(XMC_USIC_CH_t *const channel,
    const uint32_t event)
{
  channel->TRBSCR = event;
}

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param data_pointer Start position inside the FIFO buffer. \n
 * 		\b Range: 0 to 63.
 * @param size Required size of the receive FIFO. \n
 * 		\b Range: @ref XMC_USIC_CH_FIFO_DISABLED, @ref XMC_USIC_CH_FIFO_SIZE_2WORDS.. @ref XMC_USIC_CH_FIFO_SIZE_64WORDS
 * @param limit Threshold of receive FIFO filling level to be considered for generating events. \n
 * 		\b Range: 0 to \a size -1.
 * @return None
 *
 * \par<b>Description</b><br>
 * Configures the receive FIFO. \n\n
 * Receive FIFO is the subset of a common FIFO sized 64 words. This FIFO is shared between 2 channels of the USIC module.
 * Each channel can share the FIFO for transmission and reception. \a data_pointer represents the start index in the common FIFO,
 * from where received data can be put. \a size represents the size of receive FIFO as a multiple of 2.
 * Since the FIFO is shared between 2 USIC channels, FIFO size should be carefully selected. A FIFO standard receive buffer
 * event or alternative receive buffer event is generated when the FIFO filling level exceeds the \a limit value.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_RXFIFO_EnableEvent(), XMC_USIC_CH_RXFIFO_SetInterruptNodePointer() \n\n\n
*/
void XMC_USIC_CH_RXFIFO_Configure(XMC_USIC_CH_t *const channel,
                                  const uint32_t data_pointer,
                                  const XMC_USIC_CH_FIFO_SIZE_t size,
                                  const uint32_t limit);

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param size Required size of the receive FIFO. \n
 * 		\b Range: @ref XMC_USIC_CH_FIFO_DISABLED, @ref XMC_USIC_CH_FIFO_SIZE_2WORDS.. @ref XMC_USIC_CH_FIFO_SIZE_64WORDS
 * @param limit Threshold for receive FIFO filling level to be considered for generating events. \n
 * 		\b Range: 0 to \a size -1.
 * @return None
 *
 * \deprecated { Use XMC_USIC_CH_RXFIFO_SetTriggerLimit() }
 *
 * \par<b>Description</b><br>
 * Sets the size and trigger limit for the receive FIFO. \n\n
 * The API is not to be called for initializing the receive FIFO. The API shall be used for the
 * runtime change of receive FIFO trigger limit. FIFO start position will not be affected on execution.
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_SetSizeTriggerLimit()\ n\n\n
 */
void XMC_USIC_CH_RXFIFO_SetSizeTriggerLimit(XMC_USIC_CH_t *const channel,
    const XMC_USIC_CH_FIFO_SIZE_t size,
    const uint32_t limit);

/**
 * @param channel Pointer to USIC channel handler of type @ref XMC_USIC_CH_t \n
 * 				   \b Range: @ref XMC_USIC0_CH0, @ref XMC_USIC0_CH1 to @ref XMC_USIC2_CH1 based on device support.
 * @param limit Threshold for transmit FIFO filling level to be considered for generating events. \n
 * 		\b Range: 0 to \a fifo size -1.
 * @return None
 *
 * \par<b>Description</b><br>
 * Sets the trigger limit for the TX FIFO. \n\n
 *
 * \par<b>Related APIs:</b><BR>
 * XMC_USIC_CH_TXFIFO_SetSizeTriggerLimit() \n\n\n
 */
__STATIC_INLINE void XMC_USIC_CH_RXFIFO_SetTriggerLimit(XMC_USIC_CH_t *const channel,
    const uint32_t limit)
{
  channel->RBCTR = (channel->RBCTR & (uint32_t)~USIC_CH_RBCTR_LIMIT_Msk) | ((limit << USIC_CH_RBCTR_LIMIT_Pos) & USIC_CH_RBCTR_LIMIT_Msk);
}

